Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Make your favorite heroes stronger than ever!
pt_pt: Torna os teus heróis mais fortes do que nunca!

source: Oya is literally gleaming with her new Solar Skin!
pt_pt: A Oya até brilha com o novo Visual Solar!

source: Claim daily rewards this April to upgrade Kai, the peerless Way of Nature mage!
pt_pt: No mês de abril, resgata recompensas diárias para melhorar Kai, o incomparável mago do Caminho da Natureza!

source: New Zealand Dollar
pt_pt: Dólar neozelandês

source: - Martha and Markus opened their Shops to help you!
pt_pt: - A Martha e o Markus abriram as suas lojas para te ajudarem!

source: New Hero, New Adventure!
pt_pt: Novo Herói, nova aventura!

source: Meet Tempus, the Lord of Time!
pt_pt: Conhece Tempus, o Senhor do tempo!

source: Oh, this quest is a bit challenging You need to open one trapdoor after another until you finally catch the Shaman, so just keep going forward.
pt_pt: Esta missão é uma das difíceis Tens de abrir os alçapões um a seguir ao outro até conseguires finalmente apanhar o Xamã, por isso não desistas.

source: A little hint — keep an eye on the unlocked trapdoors ;)
pt_pt: Uma pequena dica: toma atenção aos alçapões destrancados ;)

source: Incorrect Pin
pt_pt: PIN incorreto

source: OR
pt_pt: OU

source: Challenge your fears in our special event and help Octavia escape the Pumpkin King!
pt_pt: Desafia os teus medos no nosso evento especial e ajuda Octavia a escapar do Rei Abóbora!

source: Terms of service
pt_pt: Termos de Serviço

source: Sign in with Google
pt_pt: Iniciar sessão via Google

source: You can also upgrade her skin and obtain a special Chest, Spheres, and other resources at a discount at the event shop!
pt_pt: Também podes melhorar o visual e obter um baú especial, esferas e um desconto em outros recursos na loja do evento!

source: Celeste, Nebula, and Artemis try on their new Spring Skins for the celebration!
pt_pt: Celeste, Nebula e Ártemis experimentam os seus novos visuais de primavera para a celebração!

source: Hurry up and unlock them!
pt_pt: Despacha-te e desbloqueia-os!

source: Click the image to get Gold and Huge EXP Potions!
pt_pt: Clica na imagem para obter Ouro e Poções de EXP Imensas!

source: The elements have granted the Titans immeasurable power that you can use in battle!
pt_pt: Os elementos dão aos Titãs um poder extraordinário que podes aproveitar em combate!

source: Crush your foes and earn event coins that can be exchanged for a Brawl Chest and other valuable resources in a special shop.
pt_pt: Oblitera os teus inimigos e ganha moedas de evento que podes trocar por um Baú de Brigas e outros recursos numa loja especial.

source: Unlock Primordial Skins for your Support Titans and Super Titans during the event!
pt_pt: Desbloqueia Visuais Primordiais para os teus Titãs e Supertitãs no evento!

source: Your dream team awaits!
pt_pt: Cria uma equipa de sonho!

source: Earn tokens to participate in Titan Brawls, defeat other players, and earn resources for your Guardians and Titans!
pt_pt: Participa em Brigas para ganhar fichas, derrota os teus adversários e ganha recursos para os teus Guardiões e Titãs!

source: Can you solve it?
pt_pt: Consegues resolvê-lo?

source: The time has come for new feats of valor! Ruckus in the Dominion Danger is looming over the Runic Forest. Assemble the heroes of the Way of Honor and save the forest creatures! Embark on an adventure full of runestone magic, generous rewards, and an unexpected ally... Who might that be? New addition to the Way of Honor A legendary smith has joined the Way of Honor. Find out how he can boost your team! Being a hero is an honor in itself!
pt_pt: Chegou a hora de grandes feitos! Zaragatas no Domínio O perigo espreita na Floresta Rúnica. Junta os heróis do Caminho da Honra e salva os habitantes da floresta! Parte numa aventura cheia de magia rúnica, recompensas incríveis e até um aliado inesperado... imaginas quem será? Nova chegada ao Caminho da Honra Chegou um ferreiro lendário, descobre como irá fortalecer a tua equipa! Ser um herói é sempre uma grande honra!

source: Get extra resources with the new Battle Pass!
pt_pt: Obtém mais recursos com o novo Passe de Batalha!

source: Kindly update the game to enjoy the new content: bit.ly/Play_IQ_now Have fun playing!
pt_pt: Por favor, atualiza o jogo para teres acesso aos novos conteúdos: bit.ly/Play_IQ_now Diverte-te!

source: Collect
pt_pt: Coleciona

source: Don’t miss a week of unique offers in the Dominion!
pt_pt: Não percas uma semana de ofertas únicas no Domínio!

source: FEATURES
pt_pt: RECURSOS

source: REMOVE 1 CAR TO LET HIM OUT
pt_pt: REMOVE 1 CARRO PARA O DEIXAR ESCAPAR

source: Hero Power Tournament!
pt_pt: Torneio do Poder do Herói!

source: REMOVE 1 STICK TO HURT ORC
pt_pt: REMOVE 1 TRAVE PARA CAUSAR DANO AO ORC

source: There's something for everyone, come see how high you can climb!
pt_pt: Há algo para todos, vê quão alto podes chegar!

source: Power up your Heroes & get a Skin+ for Kayla!
pt_pt: Melhora os heróis e obtém um Visual+ para Kayla!

source: Try improved Mojo in battles and pick up the best team for him! Experiment, fight, and win various rewards!
pt_pt: Melhorámos o Mojo! Escolhe a melhor equipa para ele e usa-o em combate! Experimenta, luta e ganha várias recompensas!

source: PLAY NOW
pt_pt: JOGAR AGORA

source: PLAY MINIGAMES!
pt_pt: DIVERTE-TE COM MINIJOGOS!

source: Gates of Chaos in Hero Wars!
pt_pt: Portões do Caos em Hero Wars!

source: Tap into the true power of Light with the new Super Titan, Solaris!
pt_pt: Descobre o verdadeiro poder da luz com a nova Supertitã, Solaris!

source: The Full Moon is shining upon the Heroes, granting them amazing power!
pt_pt: A Lua Cheia derrama a sua luz nos teus heróis e enche-os de poder!

source: Don’t miss out a special sale during the Google Full Moon 2024 event and cosmic discounts on valuable resources, including Julius’s Soul Stones, Artifacts, Runestones, Skin Stones, Chaos Cores, Huge EXP Potions, and Mastery Crystals.
pt_pt: Não percas esta promoção especial durante o evento Lua Cheia Google 2024 e aproveita os descontos em recursos valiosos, como as Pedras Anímicas de Julius, artefactos, pedras rúnicas, pedras de visual, núcleos caóticos, poções de EXP imensas e cristais de mestria.

source: One of the Heroes will receive all-new skills, growing much stronger!
pt_pt: Um dos heróis passará a ser mais forte graças a novas habilidades!

source: Test their might!
pt_pt: Põe-te à prova!

source: Titanic Rampage! New Brawl Season All Titans maxed! Match them as you wish and get rewards for each battle. And don't forget to gather a perfect team for Iyari on the last day of the event! The Element of Style Mairi, Ignis, and Avalon now improve your morale not only with their skills, but also with their style! Take a new look at these Elemental Support Titans. Get your dream team ready!
pt_pt: Agitação titânica! Nova temporada do Brawl Todos os titãs no máximo! Cria as tuas batalhas, colhe as recompensas e lembra-te de formar a equipa perfeita para a Iyari, no último dia do evento! Um toque de estilo Vê além das habilidades, deixa-te contagiar pelo estilo de Mairi, Ignis e Avalon e reforça a tua moral! Dá uma vista de olhos nos titãs de suporte elementar. Prepara a equipa!

source: Hi! We're sorry to hear that you didn't like our game. The developers will work very hard to improve the game, taking into consideration all the feedback from the players! Please contact our support team using this link https://goo.gl/o8DZCK and tell us what you think of the game! It will help us make the game better!
pt_pt: Saudações! É pena que não tenhas gostado do jogo. Os criadores continuarão a aplicar todos os esforços para melhorar o jogo, tomando em consideração os comentários dos jogadores! Contacta a nossa equipa de suporte através da ligação seguinte: https://goo.gl/o8DZCK. Diz-nos o que achas do jogo, só assim o poderemos tornar melhor!

source: Grand Arena!
pt_pt: Grande Arena!

source: Refill your supplies and reach the grand prizes!
pt_pt: Reabastece os teus mantimentos e consegue prémios!

source: This Spring Festival, the brilliant Solaris illuminates Dominion once more!
pt_pt: Nesta Festa de Primavera, a brilhante Solaris ilumina mais uma vez o Domínio!

source: Participate in the event, collect artifacts, power up Brustar, and test his skills in special brawls.
pt_pt: Participa no evento, recolhe artefactos, reforça Brustar e testa as suas habilidades em combates especiais.

source: Check out the amazing soul offers in the shop and remember that Brustar does not have a star cap!
pt_pt: Não percas as incríveis ofertas de almas na loja e lembra-te que Brustar não tem um limite de estrelas!

source: Unleash his full might and send your foes tumbling into the void!
pt_pt: Liberta toda a sua força e atira os teus inimigos para o vazio!

source: Log in every day this January to upgrade this Way of Nature warrior!
pt_pt: Inicia sessão em janeiro para melhorar o guerreiro do Caminho da Natureza!l

source: As one of the chosen wielders of a Blade of Many Truths, Elmir joined the Guardians to purge darkness from Dominion.
pt_pt: Como um dos espadachins escolhidos da Lâmina das Diversas Verdades, Elmir juntou-se aos Guardiões para eliminar a escuridão do Domínio.

source: Log into the game every day and claim daily rewards to make Elmir part of your team and build his strength!
pt_pt: Inicia sessão no jogo todos os dias e resgata recompensas diárias para tornar Elmir parte da tua equipa e aumentar a sua força!

source: Participate in a brand new Chaos Faction event and boost your Heroes along with their Artifacts!
pt_pt: Participa no novo evento da Fação do Caos e melhora os teus heróis e os seus Artefactos!

source: Galactic Week in Hero Wars!
pt_pt: Semana Galáctica no Hero Wars!

source: The arrows point to the missing pieces of the bridge.
pt_pt: As setas apontam para as peças em falta da ponte.

source: To move a piece back to the bridge, just tap on it and hold it until you can move it.
pt_pt: Para colocares uma peça de volta na ponte, basta tocares na peça sem soltar até que possas movê-la.

source: After you put all the pieces to their place, the bridge will be restored Good luck!
pt_pt: Depois de colocares todas as peças no devido lugar, a ponte estará reconstruída Boa sorte!

source: Welcome to Dominion, all snow-coated and frosty!
pt_pt: Bem-vindo a Dominion, todo coberto de neve e gelado!

source: The cold winds bring with them new challenges — open the game so you don’t miss out on a single reward!
pt_pt: Os ventos frios trazem com eles novos desafios — abra o jogo para não perder uma única recompensa!

source: The new Winterfest outfits will keep Cascade, Corvus, and Morrigan as warm as they’d be after a good battle!
pt_pt: Os novos trajes do Festival de Inverno irão manter Dilúvio, Corvus e Morrigan tão quentes como se tivessem acabado uma boa batalha!

source: Guilds!
pt_pt: Guildas!

source: EXP Booster
pt_pt: Reforço de EXP

source: Witness a new era in the history of the Dominion!
pt_pt: Testemunha uma nova era na história do Domínio!

source: Legends Drafts
pt_pt: Recrutamento de Lendas

source: Fafnir is in the Dominion!
pt_pt: Fafnir chegou ao Domínio!

source: Join the adventure!
pt_pt: Junta-te à aventura!

source: PLEASE NOTE
pt_pt: ATENÇÃO

source: Minigames
pt_pt: Minijogos

source: In the new event, you’ll unlock Lara Croft, three skins for her, a special Talisman...
pt_pt: No novo evento, irás desbloquear Lara Croft, três visuais, um Talismã especial...

source: and the true history of Dominion!
pt_pt: e a verdadeira história do Domínio!

source: Don’t miss the chance to upgrade your class runes!
pt_pt: Aproveita e melhora as tuas runas de classe!

source: To open the door, you need to press the buttons that would together be equal to the number on the door.
pt_pt: Para abrir a porta, tens de premir os botões que somam o número na porta.

source: Antique Heroes
pt_pt: Heróis Antigos

source: Explore the new Skyship mechanic, help Captain Jean defeat the Grim Fang, and earn many rewards!
pt_pt: Explora a nova mecânica de aeronaves, ajuda o Capitão Jean a derrotar a Presa Sangrenta e ganha montes de recompensas!

source: Born from the spring sunlight, she blinds her foes!
pt_pt: Nascida da luz do sol da primavera, ela cega os inimigos!

source: Increase her might with souls and artifacts from the Store of Light!
pt_pt: Aumenta o seu poder com almas e artefactos da Loja da Luz!

source: Do you think you can challenge me, newbie?
pt_pt: Pensas que podes desafiar-me, novato?

source: This account does not belong to the user.
pt_pt: Esta conta não pertence ao utilizador.

source: Stock up on resources and grab new outfits!
pt_pt: Obtém recursos e novos visuais!

source: The Lords of Darkness!
pt_pt: Os Senhores da Escuridão!

source: Hello! In our ads we aim to capture the spirit of our game in a flashy and concise manner. We are thrilled to see you were engaged by it! Hope you'll stick around to see if our game is worth your attention.
pt_pt: Olá! Os nossos anúncios são uma forma atrativa e concisa onde tentamos capturar o espírito do jogo. Estamos entusiasmados com o teu interesse e esperamos que fiques por perto para ver se o nosso jogo merece a tua atenção!

source: Join a Guild
pt_pt: Entra na Guilda

source: Kickstart the new season this March with some stellar wins!
pt_pt: Começa esta nova temporada em março com vitórias incríveis!

source: Earn valuable resources with the Battle Pass!
pt_pt: Ganha recursos valiosos com o Passe de Batalha!

source: Unlock the Premium Pass and decorate your profile with a seasonal avatar and a flower frame.
pt_pt: Desbloqueia o Passe Premium e decora o teu perfil com um avatar de temporada e uma moldura de flor!

source: Grow stronger and defeat the most ferocious foes!
pt_pt: Fica mais forte e derrota os inimigos mais ferozes!

source: Complete season event quests and earn Battle Pass points!
pt_pt: Conclui missões da temporada e ganha pontos do Passe de Batalha!

source: Get all the resources and attain special trophies!
pt_pt: Obtém recursos e troféus especiais!

source: New Talismans to power up your Guardians are here.
pt_pt: Há novos talismãs para os teus Guardiões!

source: The enemy has no chance!
pt_pt: O inimigo nem sabe o que o espera!

source: Talismans for All
pt_pt: Talismãs para todos

source: New Hero in the Dominion!
pt_pt: Novo herói no Domínio!

source: Access denied
pt_pt: Acesso negado

source: Come on, big guy!
pt_pt: Anda lá, grandalhão!

source: Smash them to shreds!
pt_pt: Transforma-os em polpa!

source: Complete event quests and win to earn valuable resources, including a special Titan Chest!
pt_pt: Conclui missões do evento e ganha recursos valiosos, incluindo um Baú de Titã especial!

source: Cornelius Witt became a Guardian after learning to suppress magic!
pt_pt: Cornelius Witt é um Guardião capaz de suprimir magia!

source: Improve his stats through Daily Quests!
pt_pt: Conclui Missões Diárias para o melhorar!

source: Upgrade Heroes, earn points, and climb the ranks!
pt_pt: Melhora Heróis, ganha pontos e sobe na classificação!

source: Get ready for great rewards, including a special first-place avatar!
pt_pt: Obtém recompensas, incluindo um avatar especial de primeiro lugar!

source: By signing up, you agree to our _Terms of Service_ and _Privacy and Cookie Policy_
pt_pt: Ao efetuares o registo, concordas com os nossos _Termos de Serviço_ e com a nossa _Política de Privacidade e Cookies_

source: Venture to the true adventure ‍♂️ Play it out YOUR way!
pt_pt: Aventura-te ‍♂️ Joga à TUA maneira!

source: User already linked
pt_pt: Utilizador já associado

source: In this puzzle, you need to place the knots so that no ropes cross one another.
pt_pt: Neste quebra-cabeças, tens de colocar os nós de forma a que nenhuma corda se cruze com outra.

source: Keep changing the positions of the knots until all the ropes are green.
pt_pt: Continua a mudar as posições do nós até que todas as cordas fiquem verdes.

source: Hope this was helpful!
pt_pt: Espero ter ajudado!

source: Cookie policy
pt_pt: Política de Cookies

source: Forge a path to unlimited power during this event! Increase your Hero Power to earn the highest score and get ahead of the competition in your group! Do well enough, and you'll get even more resources to upgrade your characters, or get first place to snag yourself a special avatar!
pt_pt: Abre caminho para teres poder ilimitado durante este evento! Aumenta o teu Poder de Herói para obter a melhor pontuação e ultrapassa a competição no teu grupo! Quanto melhor fores, mais recursos irás ganhar para melhorar as tuas personagens. Ou então obtém o primeiro lugar para conseguir um avatar especial!

source: Complete exciting quests for rewards!
pt_pt: Conclui missões e ganha recompensas!

source: If you already have another account on throne-rush.com you want to continue with, please log out from current session.
pt_pt: Se já tiveres outra conta em throne-rush.com com a qual queiras continuar, sai da sessão atual.

source: After this you will be redirected to the home page.
pt_pt: Em seguida, iremos redirecionar-te para a página inicial.

source: Attention!
pt_pt: Atenção!

source: After logging out you will lose access to current account.
pt_pt: Depois de terminares sessão, perderás o acesso à tua conta atual.

source: To save progress on current account, you may sign up.
pt_pt: Para guardares o progresso na tua conta atual, regista-te.

source: Sign Up Log Out
pt_pt: Regista-te Termina sessão

source: Hello! So nice to see you tried our game out! Knowing you are concerned with our ad makes us feel uneasy though. We sure hope you won't feel bad about it once you give our game a chance. Lots of cool stuff is in it we couldn't cram into an ad.
pt_pt: Olá! Que bom que experimentaste o nosso jogo! Porém, saber que estás preocupado com o anúncio faz-nos sentir apreensivos. Esperamos que te sintas melhor quando deres uma oportunidade ao jogo, porque há muitas coisas interessantes que não conseguimos incorporar no anúncio.

source: The cold winds bring with them new challenges!
pt_pt: Os ventos frios trazem novos desafios!

source: Join in to earn rewards and new skins for Cascade, Corvus, and Morrigan!
pt_pt: Junte-se para ganhar recompensas e novos visuais para Dilúvio, Corvus e Morrigan!

source: The Titans of Dominion clash in grand battle!
pt_pt: Os Titãs do Domínio colidem numa grande batalha!

source: Each mistake is costly But you got it, champ!
pt_pt: Errar tem um preço Mas estás em grande!

source: Thanks for trying out Hero Wars!
pt_pt: Obrigado por teres experimentado o Hero Wars!

source: In the ad, we intended to capture the essence of the game, as it’s too diverse to put it all in one short video.
pt_pt: No anúncio tentamos capturar a essência do jogo, mas é impossível mostrar toda a sua diversidade num pequeno vídeo.

source: We’re sorry that the game didn’t meet your expectations.
pt_pt: Lamentamos se o resultado não correspondeu às tuas expetativas.

source: We are improving our game mechanics, so you can already try the Tower gameplay!
pt_pt: Estamos a melhorar a jogabilidade, por isso já podes experimentar o modo Torre!

source: Hope you’ll give Hero Wars another chance!
pt_pt: Esperamos que dês uma nova oportunidade ao Hero Wars!

source: Log into the game daily to obtain Galahad's Soul Stones!
pt_pt: Entra no jogo todos os dias e ganha Pedras Anímicas para Galahad!

source: You need to allow
pt_pt: Tens de permitir o

source: Enjoying Hero Wars?
pt_pt: Estás a gostar de Hero Wars?

source: Learn more:
pt_pt: Descobre mais:

source: We can totally understand how it feels when energy runs out :( The good thing though is that there are plenty of ways to earn more energy!
pt_pt: Compreendemos o que sentes quando a energia acaba :( O lado positivo é que existem formas de ganhar mais energia!

source: Like burning fruits in the cauldron, opening chests on the Island, completing boat orders, and many more!
pt_pt: Podes cozinhar frutas no caldeirão, abrir arcas na Ilha, concluir ordens de barco e muito mais!

source: And don't forget that reaching a new level fills the energy bar to the max :) Hope this was helpful!
pt_pt: Além disso, não te esqueças que alcançar um nível novo enche a barra de energia ao máximo :) Esperamos que esta informação seja útil!

source: New Masquerade Skins!
pt_pt: Novos visuais de Mascarados!

source: Unknown error
pt_pt: Erro desconhecido

source: The Power of Temptation!
pt_pt: O poder da tentação!

source: You can look a little</br> at the void and Kira or click</br> on the link below:
pt_pt: Podes olhar um pouco</br> para o vazio e para a Kira ou clicar</br> no link abaixo:

source: The heroes have gather at the draft tavern to prove themselves once again!
pt_pt: A taverna de recrutamento está cheia de Heróis que querem mostrar o que valem!

source: Join the throw-down: assemble the best possible teams of fearless attackers and resilient defenders to come out on top in any clash.
pt_pt: Junta-te à luta: escolhe atacantes poderosos e defensores resistentes para criar a melhor equipa e vencer tudo e todos!

source: Dynamic matches in real-time and trophies for each victory await you!
pt_pt: As partidas dinâmicas dão-te troféus por cada vitória!

source: Prove your supremacy and become a draft legend!
pt_pt: Arrasa a competição e transforma-te numa lenda do recrutamento!

source: Free Gold and EXP Potions!
pt_pt: Ouro e Poções de EXP grátis!

source: • We’re introducing in-game puzzles!
pt_pt: • Vamos adicionar quebra-cabeças ao jogo!

source: Don't miss a unique opportunity to get lots of essential resources to upgrade your Guardians and defeat everyone!
pt_pt: Não percas a oportunidade de obter toneladas de recursos para melhorar os teus Guardiões! Derrota tudo e todos!

source: Revered as rare and valuable in Dominion, talismans grant immense power to their wielder.
pt_pt: Apreciados no Domínio por serem raros e valiosos, os talismãs concedem imenso poder a quem os estiver a usar.

source: Surely the heroes featured in this event couldn't refuse such a gift!
pt_pt: Os heróis deste evento não poderiam recusar esse presente!

source: Complete quest chains and get talismans for Ginger, Kayla, Luther, Mojo, Octavia, and Dark Star.
pt_pt: Conclui missões e obtém talismãs para a Ginger, a Kayla, o Luther, o Mojo, a Octavia e a Estrela Sombria.

source: Upgrade them to unlock extra stat slots and come crashing down on your enemies!
pt_pt: Melhora-os para desbloquear mais atributos e para abateres os teus inimigos!

source: if you don't have an account
pt_pt: se não tiveres uma conta

source: Help Maya's powers come into full bloom!
pt_pt: Dá mais poder a Maya!

source: Log into the game daily this month to harvest the Mystery Healer's Soul Stones!
pt_pt: Este mês, inicia sessão diariamente e obtém Pedras Anímicas para a curandeira misteriosa!

source: Let the stalks binding her foes grow stronger and the blossom that grants her protection never wilt!
pt_pt: Que as plantas que prendem os inimigos dela tenham força e que a flor que a protege nunca murche!

source: We are sorry to hear you experience issues with the game.
pt_pt: Lamentamos que estejas a ter problemas com o jogo.

source: Please contact our tech support in the in-game settings or via this link: bit.ly/HWSupport It will help us a lot in further optimization of the game.
pt_pt: Contacta o suporte técnico nas configurações do jogo ou através do link bit.ly/HWSupport para ajudar-nos a otimizar ainda mais o jogo.

source: Thank you!
pt_pt: Obrigado!

source: Don't miss the chance to strengthen Kai, Cleaver, and Artemis with a new look!
pt_pt: Aproveita e dá um novo ar a Kai, Cleaver e Artemis!

source: Feel the summer vibe!
pt_pt: O verão está aí!
